import React, {useEffect, useState} from 'react';
import Header from "./Components/Header";
import {PostAccount} from "./model/types";
import axios from "axios";
import Footer from './Components/Footer';
// @ts-ignore
import apache from "../Img/apache.jpg";

const History: React.FC = () => {
    const [post,setPost] = useState<PostAccount>()
    useEffect(() => {
        axios.get(`http://localhost:3000/post/${post?.id}`)
            .then(res => {
                setPost(res.data)
            })
            .catch(error => {
                console.log(error)
            })
    })
    return (
        <div className="page_History">
            <Header />
            <div className="content_History">
                <p className="title_History"> Історія</p>
                <div className="text_History" >
                            Воєнна історія
                    24 серпня 1991 року Верховна Рада України прийняла постанову «Про військові формування в Україні», якою визначила: «підпорядкувати всі військові формування, дислоковані на території України, Верховній Раді України; утворити Міністерство оборони України; Урядові України приступити до створення Збройних Сил України». Фактично цією постановою було покладено початок будівництва Збройних Сил України як важливого інституту держави і невід’ємного елемента її воєнної організації.

                    Історію будівництва Збройних Сил України можна поділити на ряд основних етапів: перший етап — формування основ Збройних Сил України (1991–1996 рр.); другий етап — подальше будівництво Збройних Сил України (1997–2000 рр.); третій етап — реформування Збройних Сил України (2001–2005 рр.); четвертий етап — розвиток Збройних Сил України (2006–2011 рр.). З 2012 по 2017 роки планувалося здійснити новий етап військової реформи — реформування і розвитку Збройних Сил України. Однак у зв’язку з агресією Російської Федерації виконання заходів даного етапу було зупинено.

                    Восени — взимку 1991 року були підготовлені важливі документи, що стали нормативно-правовою базою формування Збройних Сил України.

                    11 жовтня 1991 року Верховна Рада України затвердила Концепцію оборони і будівництва Збройних Сил України та постановила створити Раду оборони України, затвердила склад посадових осіб, які до неї входять, а також Положення про Раду оборони України.

                    У Концепції передбачалося, що Україна поступово, з урахуванням усіх факторів національної безпеки, реалізуватиме намір стати в майбутньому нейтральною, без’ядерною державою, яка не братиме участі у військових блоках, натомість дотримуватиметься усіх договорів і угод щодо незастосування ядерної зброї. Концепція визначала, що Збройні Сили України складатимуться з трьох видів: Сухопутних військ (Військ наземної оборони), Військово-Повітряних Сил і Сил Протиповітряної оборони (Військ повітряної оборони), Військово-Морських Сил. У Концепції було визначено повноваження Міністра оборони України і Головного штабу Збройних Сил України.

                    Однією з найважливіших і суперечливих проблем у всьому комплексі питань військової сфери була проблема ядерної зброї. Після розпаду Радянського Союзу Україна стала власником третього за величиною ядерного потенціалу у світі. На озброєнні військових формувань в Україні знаходилося 130 міжконтинентальних ракет РС-18 на рідкому паливі з шістьма ядерними боєголовками кожна і 46 ракет РС-22 на твердому паливі з десятьма боєголовками. В усьому світі ці ракети були відомі як СС-19 та СС‑24 відповідно. В Україні було також розгорнуто повітряний компонент стратегічних сил, який складали 21 бомбардувальник ТУ-95мс та 19 бомбардувальників ТУ-160 з боєкомплектом до 500 крилатих ядерних ракет.

                    Верховна Рада України затвердила принцип без’ядерності, закріплений у Декларації про державний суверенітет України від 16 липня 1990 року. Україна зобов’язалась вивезти до Росії ядерну зброю для її розукомплектування під спільним контролем. Виходячи з проголошених зобов’язань щодо без’ядерного статусу, Україна обрала компромісний і найбільш реальний у тих умовах шлях забезпечення своєї безпеки — шлях ядерного роззброєння. Концепція його розкривалася у формулі: ядерне роззброєння в обмін на спільний контроль за цим процесом, фінансову компенсацію і гарантії національної безпеки.

                    6 грудня 1991 року Верховна Рада України приймає надзвичайно важливі для військового будівництва закони — «Про оборону України» і «Про Збройні Сили України». Того ж дня було затверджено текст Військової присяги, яку в залі Верховної Ради першим склав Міністр оборони України генерал-полковник К.П. Морозов. 3 січня 1992 року розпочався процес приведення до добровільної присяги на вірність народові України дислокованих на українській території військ.

                    Указом Президента України від 5 квітня 1992 року № 209 на базі сил Чорноморського флоту почалося формування органів управління Військово-Морських Сил України.

                    У середині червня 1992 року Верховна Рада України ратифікувала Договір про звичайні збройні сили в Європі, яким визначалися максимальні рівні озброєння і військової техніки для України. Необхідно було скорочувати кількість танків на 5300 одиниць, бойових броньованих машин — на 2400 одиниць, бойових літаків — на 477 одиниць. До реалізації цих завдань Україна приступила вже 18 серпня 1992 року.

                    Згідно з Указом Президента України від 28 січня 1993 року на базі Військово-Повітряних Сил України та Військ Протиповітряної оборони України розпочалося формування єдиного виду Збройних Сил України — Військ Повітряної оборони. Остаточне їх об’єднання передбачалося завершити до 30 листопада 1995 року.

                    19 жовтня 1993 року Верховна Рада України розглянула План проведення організаційних заходів у Збройних Силах України. Було прийнято Постанову «Про загальну структуру, чисельність та матеріально-технічне забезпечення Збройних Сил України», якою було визначено чисельність Збройних Сил України — 455 тис. військовослужбовців. На цьому ж засіданні Верховної Ради України була затверджена Воєнна доктрина України, яка визначила необхідність приведення системи оборони країни у відповідність до сучасних геополітичних і геостратегічних умов, переглянути та уточнити завдання і зміст діяльності всіх державних структур, організацій і закладів, причетних до забезпечення воєнної безпеки України.

                    У 1994 році закінчилося міждержавне переміщення військових кадрів. З 1991 до 1994 року з України в інші держави було переведено близько 12 тис. офіцерів і прапорщиків, понад 33 тис. повернулося на Батьківщину, у тому числі 27982 офіцери.

                    Подальше будівництво Збройних Сил України супроводжувалося значним скороченням чисельності особового складу та озброєнь. За рахунок розформування деяких частин, удосконалення організаційно-штатної структури чисельність Збройних Сил України станом на кінець 1995 року було скорочено до 400 тис. осіб.

                    Згідно з Указом Президента України від 23 травня 1996 року у складі Збройних Сил України формується командування Сухопутних військ України, якому підпорядковуються органи управління та війська військових округів.

                    З причин відсутності належної нормативно-правової бази та добре обґрунтованих теоретичних положень щодо створення нового виду Збройних Сил України, у 1996 році процес об’єднання ВПС та Військ ППО було призупинено.

                    На 1 червня 1996 року Україна завершила процес свого ядерного роззброєння, на її території не залишилося жодного ядерного боєзаряду або боєприпасу.

                    Підсумовуючи перший, найскладніший етап будівництва Збройних Сил України (1991–1996 рр.), слід зазначити, що незважаючи на різноманітні труднощі, були закладені основи національного війська незалежної держави: за короткий термін були створені Міністерство оборони України, Генеральний штаб Збройних Сил України, види Збройних Сил України, системи управління, підготовки і всебічного забезпечення військ (сил) тощо.

                    У січні 1997 року Президентом України була затверджена Державна програма будівництва та розвитку Збройних Сил України на період до 2005 року. З цього розпочався другий етап військового будівництва в Україні. Перший рік реалізації положень Державної програми будівництва та розвитку Збройних Сил України вніс суттєві зміни до переліку заходів і термінів їх виконання.

                    21 січня 1997 року Указом Президента України були затверджені Положення «Про Міністерство оборони України» та «Про Генеральний штаб Збройних Сил України». Міністерство оборони і Генеральний штаб Збройних Сил уперше отримали свої окремі Положення, що було не лише подальшим упорядкуванням їх повноважень і відповідальності, але й важливим кроком на шляху становлення демократичного цивільного контролю над оборонною сферою.

                    Повноваження Генерального штабу Збройних Сил України значно поширилися на здійснення планування оборони держави і оперативного управління. Відтепер Генеральний штаб Збройних Сил України отримав право на здійснення контролю за виконанням завдань з організації оборони держави усіма військовими формуваннями України. Були суттєво уточнені повноваження Міністерства оборони.

                    У 1997 році вперше було проведено цикл стратегічного планування оборони України. За його підсумком Президентом України затверджено Стратегічне рішення на застосування Збройних Сил України.

                    На початку червня 1997 року нарешті було вирішено одне з найбільш складних питань — питання про Чорноморський флот. Було підписано Угоду про статус, умови та термін перебування Чорноморського флоту Російської Федерації на території України. 1 серпня 1997 року Україна вперше святкувала День Військово-Морських Сил України.

                    З 1998 року запроваджена нова система військово-адміністративного розподілу території України. Замість військових округів було утворено оперативні командування. Функціонально вони стали оперативно-стратегічними об’єднаннями, призначеними для виконання як у мирний, так і у воєнний час оперативних, мобілізаційних завдань і завдань територіальної оборони у встановлених для них межах, а також технічного, тилового, медичного та інших видів забезпечення військ (сил), що знаходяться на їх територіях, незалежно від відомчої підпорядкованості.

                    Згідно з пропозиціями Президента України, Постановою Верховної Ради України від 22 грудня 1998 року була затверджена чисельність Збройних Сил: станом на 31 грудня 1998 року — 320 тис. військовослужбовців і 100 тис. працівників; на 31 грудня 1999 року — 310 тис. військовослужбовців і 90 тис. працівників.

                    Під час реалізації Державної програми будівництва та розвитку Збройних Сил України щодо удосконалення структури військ (сил) постійно враховувалися результати заходів оперативної підготовки органів управління. Планування та проведення заходів оперативної підготовки стало здійснюватися за єдиним замислом і планом та на єдиному оперативно-стратегічному фоні.

                    З початку 1999 року здійснено перехід на нову систему тилового забезпечення за територіальним принципом. Завдяки її впровадженню вдалося уніфікувати і скоротити кількість тилових структур, забезпечити інтеграцію ресурсів, сил та засобів тилу і комплексне та ефективне їх використання в інтересах усіх структур Збройних Сил України.

                    Період виконання Державної програми реформування та розвитку Збройних Сил України (2001–2005 рр.). можна вважати третім етапом будівництва Збройних Сил України.

                    З метою подальшого удосконалення та підвищення ефективності системи управління Збройними Силами України Указом Президента України від 20 серпня 2001 року введено посади головнокомандувачів видів Збройних Сил України.

                    22 березня 2001 року Верховна Рада України прийняла Закон «Про розвідувальні органи України». Це логічно завершило тривалий етап обговорення та ввело у правову сферу діяльність спеціальних органів державної влади, серед яких — розвідка Збройних Сил України .

                    У 2002 році було завершено розформування 43 Ракетної армії. Цим Україна ще раз продемонструвала світовій спільноті обов’язковість у дотриманні міжнародних зобов’язань з без’ядерного статусу держави.

                    У 2004–2005 роках здійснено перехід Збройних Сил з чотирьохвидової на тривидову структуру шляхом створення на базі ВПС і Військ ППО єдиного виду Збройних Сил — Повітряних Сил у складі трьох повітряних командувань («Захід», «Південь», «Центр») і тактичної групи «Крим».

                    Важливим елементом у запровадженні механізму демократичного цивільного контролю над Збройними Силами України стало створення у 2005 році консультативно-дорадчого органу — Громадської ради при Міністерстві оборони України.

                    Головні командування видів Збройних Сил України були переформовані у командування видів з відповідною оптимізацією їх структури та чисельності. З трьох оперативних командувань залишилися два (Західне та Південне), а північне оперативне командування переформовано у територіальне управління «Північ». З метою оптимізації системи оперативного (бойового) та матеріально-технічного забезпечення сформовано Командування сил підтримки. До його складу увійшли понад 50 військових частин і підрозділів забезпечення.

                    Загальна чисельність особового складу Збройних Сил України станом на кінець 2005 року складала 245 тис. осіб, у т.ч. 180 тис. військовослужбовців. Співвідношення між видами Збройних Сил становило: Сухопутні війська — до 40%; Повітряні Сили — до 24%; Військово-Морські Сили — до 8%; органи військового управління, військові навчальні заклади, установи — до 28%.

                    За результатами виконання Державної програми реформування та розвитку Збройних Сил України протягом 2001–2005 років відбулися суттєві зміни у структурі Збройних Сил та системі управління військами (силами). Зокрема, був запроваджений функціональний принцип побудови Збройних Сил та їх застосування. Здійснено розподіл функцій та повноважень між Міністерством оборони України та Генеральним штабом Збройних Сил України. Функціональними структурами Збройних Сил стали Об’єднані сили швидкого реагування, Основні сили оборони і Стратегічні резерви. Пріоритет у формуванні був наданий Об’єднаним силам швидкого реагування.

                    У загальній системі розмежування функцій та повноважень між Міністерством оборони України та Генеральним штабом Збройних Сил України на виконання Указу Президента України від 12 січня 2004 року № 28/2004 «Про Концепцію гуманітарного і соціального розвитку у Збройних Силах України» здійснено розподіл завдань й у гуманітарної та соціальної сферах, закладено основи системи реалізації державної гуманітарної та соціальної політики в Збройних Силах уякої:

                    на Міністерство оборони України покладені завдання з підготовки держави до оборони у мирний час, що спрямовані на суспільство: формування морально-політичного та соціального потенціалу обороноздатності держави, а саме: соціальні й гуманітарні аспекти забезпечення військової служби, військово-патріотичне виховання громадян України, взаємодія з органами державної влади, місцевого самоврядування та громадськими організаціями щодо підготовки молоді до служби в Збройних Силах України, а також нормативно-правове та організаційно-методичне забезпечення реалізації соціальної та гуманітарної складової військової служби у Збройних Силах України. Координуючим та аналітичним органом Міністерства оборони України з питань гуманітарної та соціальної політики держави у Збройних Силах визначено Департамент гуманітарного та соціального розвитку Міністерства оборони України.

                    на Генеральний штаб Указом Президента України покладено здійснення гуманітарного та соціального забезпечення діяльності Збройних Сил. Органом Генерального штабу Збройних Сил України, що здійснює планування, організацію та контроль за діяльністю військового командування з питань гуманітарного і соціального розвитку визначено Головне управління з гуманітарних питань Збройних Сил України.

                    Загалом, упродовж 2001–2005 років було проведено близько 16 тис. організаційних заходів з реструктуризації Збройних Сил.

                    Четвертий етап будівництва Збройних Сил України розпочався у 2006 році з виконання завдань, визначених Державною програмою розвитку Збройних Сил України на 2006–2011 роки.

                    Відповідно до Указу Президента України від 1 лютого 2007 року «Про затвердження Положення про проходження громадянами України служби у військовому резерві Збройних Сил України» розпочалося впровадження служби у військовому резерві Збройних Сил України.

                    У 2009 році розширено коло осіб, які мають право вступу на військову службу за контрактом. За результатами реалізації Концепції кадрової політики у Збройних Силах України з 1 січня 2010 року запроваджено систему кадрового менеджменту централізованого типу, спрямовану на забезпечення потреб військ (сил) в особовому складі, сприяння кожній особі в індивідуальному розвитку та можливості реалізації її потенціалу, бачення кожним військовослужбовцем перспективи свого кар’єрного зростання. Створено 25 територіальних центрів комплектування військовослужбовцями служби за контрактом.

                    Головною подією 2010 року, яка визначально вплинула на безпекову ситуацію, стало оголошення Законом України «Про засади внутрішньої і зовнішньої політики» позаблокового статусу України, що означає її неучасть у військово-політичних союзах, пріоритетність участі у вдосконаленні та розвитку європейської системи колективної безпеки, продовження конструктивного партнерства з Організацією Північноатлантичного договору та іншими військово-політичними блоками з усіх питань, що становлять взаємний інтерес. У відповідності з цим було конкретизовано порядок застосування Збройних Сил України.

                    У квітні 2011 року Указом Президента України затверджено Положення про Міністерство оборони України та Положення про Генеральний штаб Збройних Сил України, у яких конкретизовано завдання цих органів військового управління, виходячи з нових умов функціонування Збройних Сил України.

                    Удосконалено систему військової освіти та науки. Створено потужні видові навчально-наукові центри, до складу яких входять навчальні підрозділи (факультети, кафедри академій (університету), коледжі сержантського складу) та наукові підрозділи (наукові центри). Це дозволило зосередити на єдиних навчальних базах підготовку, перепідготовку та підвищення кваліфікації військових фахівців усіх рівнів військового управління, забезпечити інтеграцію військової освіти та науки, зменшити бюджетні видатки на їх утримання.

                    З метою налагодження системного діалогу з інститутами громадянського суспільства, надання можливості доступу до інформації про діяльність Збройних Сил України, забезпечення гласності, відкритості та прозорості діяльності Міністерства оборони України, забезпечення системного впливу інститутів громадянського суспільства на реалізацію соціальних прав військовослужбовців та членів їх сімей у 2005 році створено Громадську раду при Міністерстві оборони України.

                    Щорічно, у взаємодії з органами державної влади, місцевого самоврядування та громадськими організаціями проводилася велика кількість заходів військово-патріотичного спрямування та культурно-мистецьких акцій з нагоди відзначення державних та професійних свят, пам’ятних, знаменних дат і подій.

                    Набули системності заходи з усунення протиріч щодо свободи віросповідання у Збройних Силах, були опрацьовані механізми задоволення релігійних потреб віруючих військовослужбовців. У 2009 році створено Раду у справах душпастирської опіки при Міністерстві оборони України.

                    З метою сприяння проведенню ефективної державної політики з питань сім’ї, гендерної рівності, подальшого згуртування військових колективів у Збройних Силах створено Ради сімей військовослужбовців Збройних Сил України.

                    Загалом протягом 2006–2011 років удосконалено структуру та скорочено чисельність Збройних Сил, сформовано корпус швидкого реагування Сухопутних військ, реформовано систему військової освіти, кадрового і медичного забезпечення, розширено сферу діяльності міжнародного військового співробітництва. Чисельність Збройних Сил зменшено з 245 тис. до 192 тис. осіб.

                    Питому вагу бойових з’єднань і військових частин доведено до 47 %, військових частин і підрозділів логістики, військових навчальних закладів, установ та організацій — до 53 %. Уточнено розподіл бойового складу Збройних Сил за функціональними структурами. Кількість вищих військових навчальних закладів і військових навчальних підрозділів вищих навчальних закладів зменшено з 60 до 31. Зріс масштаб навчань з органами військового управління, військами (силами). Проведено сім основних широкомасштабних навчань (тренувань).

                    Поновлено підготовку військовозобов’язаних на навчальних (перевірочних) зборах та підготовлено понад 16 тис. військовозобов’язаних із залученням 245 військових організаційних структур.

                    Проведено 4,3 тис. заходів міжнародного військового співробітництва. У період 2006–2011 років понад 23 тис. військовослужбовців взяли участь у 95 міжнародних навчаннях (52 — за межами України, 43 — в Україні). Майже 6 тис. військовослужбовців виконували миротворчі завдання у складі 13 миротворчих місій в 11 країнах світу. У Збройних Силах продовжено виконання заходів щодо участі у Процесі планування та оцінки сил у рамках програми «Партнерство заради миру» і реалізацію положень Концепції оперативних можливостей НАТО.

                    Прийнято на озброєння 112 нових і модернізованих зразків озброєння та військової техніки. Закуплено понад 1300 нових і модернізованих основних зразків ОВТ та понад 7 тис. одиниць іншого військового майна.

                    Введена нова система харчування (через структури підприємницької діяльності) 100% військових частин (установ) Збройних Сил.

                    Основою для глибоких трансформацій у сфері національної безпеки стали нові редакції Воєнної доктрини України та Стратегії національної безпеки України, схвалені у червні 2012 року. У розвиток їх положень Указом Президента України схвалений Стратегічний оборонний бюлетень України, розроблений за результатами оборонного огляду, що тривав з 2010 року, і який є концептуальним документом реформування і розвитку Збройних Сил, інших складових сил безпеки і оборони на довгострокову перспективу.

                    На підставі Стратегічного оборонного бюлетеня України Указом Президента України затверджена Концепція реформування і розвитку Збройних Сил України на період до 2017 року, прийняття якої ознаменувало новий етап військової реформи. Головною метою військової реформи є створення у короткі строки якісно нових Збройних Сил європейського типу, професійних та мобільних, добре оснащених та підготовлених, спроможних адекватно реагувати на сучасні загрози національній безпеці у воєнній сфері.

                    З метою утвердження в особового складу Збройних Сил і молоді патріотизму, духовності, моральності, формування національної гідності, психологічних і військово-професійних якостей, необхідних для виконання завдань за призначенням у 2012 році, розроблено Програму військово-патріотичного виховання у Збройних Силах України на 2012–2017 роки.

                    Логічним кроком на шляху реформування Збройних Сил, спрямованим на набуття військами можливостей швидко і результативно реагувати на загрози національній безпеці держави у військовій сфері, стало формування у 2012 році нового роду військ — Високомобільних десантних військ.

                    У 2012 році Збройними Силами України успішно проведено комплекс дослідницьких, експериментальних командно-штабних навчань з органами військового управління та військами (силами) «Перспектива — 2012». Протягом року проведено 11 багатонаціональних навчань, з них 4 на території України.

                    2012 рік був ознаменований визначною подією — 20-ю річницею участі України у миротворчих операціях та місіях ООН з підтримання миру. Активна миротворча діяльність Збройних Сил України стала важливим чинником зовнішньої політики держави та сприяла підвищенню авторитету України у світі.

                    На кінець 2012 року чисельність Збройних Сил України становила до 184 тис. осіб, у тому числі — до 139 тис. військовослужбовців.

                    З метою підтримання високого морального духу особового складу Збройних Сил України, виховання у військовослужбовців почуття особистої відповідальності за захист Батьківщини, розуміння засад державної політики та заходів, що здійснюються в інтересах забезпечення національної та міжнародної безпеки 5 лютого 2013 року наказом Міністерства оборони України було затверджено Концепцію ідеологічної роботи у Збройних Силах України. З метою її реалізації введено новий предмет у системі бойової підготовки — воєнно-ідеологічна підготовка.

                    У 2013 році вперше за останні роки на потреби оборони були передбачені видатки менше 1 % ВВП, що не дозволило в повному обсязі забезпечити ресурсні потреби Збройних Сил. Продовжувалося скорочення особового складу та оптимізація всіх ланок військового управління. У Сухопутних військах розформовано територіальне управління «Північ» та змінено організаційно-штатну структуру механізованих бригад. У Військово-Морських Силах розформовано Центр морських операцій. Високомобільні десантні війська виведено з підпорядкування командуванню Сухопутних військ і включено до складу військ, безпосередньо підпорядкованих Генеральному штабу.

                    Указом Президента України від 22 лютого 2013 року № 85 Національному університету оборони України присвоєно ім’я Івана Черняховського.

                    Було продовжено перехід військ (сил) до комплектування виключно військовослужбовцями за контрактом. Протягом 2013 року на військову службу за контрактом прийнято понад 12 тис. осіб, що дало можливість довести укомплектованість Збройних Сил військовослужбовцями за контрактом до 69,6 %. Майже третину військовослужбовців за контрактом становили жінки, що демонструвало стабільну гендерну політику.

                    Протягом 2013 року розширено участь миротворчих контингентів та персоналу Збройних Сил України у міжнародних операціях з підтримання миру і безпеки: близько 2 тис. військовослужбовців взяли участь у 13 операціях з підтримання миру на території 8 країн світу та районі Аб’єй.

                    З метою покращення душпастирської опіки у Збройних Силах у травні 2013 року затверджено «Кодекс військового священика (капелана)».

                    На кінець 2013 року чисельність Збройних Сил України становила 165,5 тис. осіб, у тому числі — 120,9 тис. військовослужбовців.

                    Після відмови керівництва держави на чолі з В.Януковичем підписати Угоду про асоціацію між Україною та Євросоюзом і силового розгону мітингу студентів у Києві 30 листопада 2013 року почалося відкрите протистояння, яке у подальшому переросло у Революцію гідності. Ще до втечі В.Януковича з України Російська Федерація 20 лютого 2014 року розпочала спецоперацію по захопленню Криму, яка надалі переросла у російську збройну агресію проти нашої держави та війну на сході України.

                    Виходячи з необхідності захисту прав та інтересів громадян України, суверенітету, територіальної цілісності та недоторканності державних кордонів України, недопущення втручання в її внутрішні справи, з огляду на порушення російською стороною положень Меморандуму про гарантії безпеки у зв’язку з приєднанням України до Договору про нерозповсюдження ядерної зброї від 5 грудня 1994 року, Договору про дружбу, співробітництво і партнерство між Україною і Російською Федерацією від 31 травня 1997 року, а також зважаючи на рішення Ради Федерації Федеральних Зборів Російської Федерації щодо використання збройних сил Російської Федерації на території України 1 березня 2014 року Збройні Сили були приведені у бойову готовність ПОВНА, а 17 березня 2014 року в Україні оголошено часткову мобілізацію. З цього часу держава почала функціонувати в умовах особливого періоду.

                    Через агресивні дії незаконних збройних формувань в окремих районах Донецької та Луганської областей, які призвели до припинення діяльності місцевих органів влади, керівництво держави прийняло рішення щодо проведення на цих територіях антитерористичної операції та виконання завдань територіальної оборони. Для безпосереднього управління силами і засобами, які залучалися до участі у проведенні антитерористичної операції, був створений оперативний штаб на чолі з керівником Антитерористичного центру при Службі безпеки України.

                    На початок проведення антитерористичної операції на сході України підрозділи Збройних Сил не мали достатньої кількості озброєння і техніки, особовий склад був слабо підготовлений. Наявне модернізоване та нове озброєння, що отримували підрозділи Збройних Сил в одиничних екземплярах, не впливало на боєздатність частин і підрозділів. Завдання по захисту України виконувалися завдяки самопожертві та героїзму воїнів. У перший період АТО велику допомогу підрозділам Збройних Сил надали добровольчі батальйони.

                    Одночасно із збільшенням угруповання військ (сил) в окремих районах Донецької та Луганської областей здійснювався перехід системи матеріально-технічного забезпечення Збройних Сил, побудованої за територіальним принципом, на функціонування в умовах проведення антитерористичної операції. На етапі розгортання системи матеріально-технічного забезпечення вирішення значної частини проблем Збройних Сил взяв на себе волонтерський рух.

                    Розвиток подій у 2014 році показав, що існує необхідність проведення докорінних змін у підходах до формування засад державної політики. Тому було відмінено позаблоковий статус України, зупинено виконання заходів Державної комплексної програми реформування і розвитку Збройних Сил України на період до 2017 року, як такої, що не відповідає сучасній воєнно-політичній обстановці та не забезпечує спрямування наявних державних ресурсів на пріоритетні напрями розвитку Збройних Сил.

                    Керівництвом держави визначено основним стратегічним напрямом реалізації державної політики у сфері оборони — забезпечення готовності сектору безпеки і оборони, економіки та суспільства до відбиття збройної агресії проти України.

                    З метою припинення конфлікту на території Донецької та Луганської областей України 5 вересня і 19 вересня 2014 року були підписані Мінський протокол і Мінський меморандум.

                    Протягом 2014 року виконано комплекс заходів щодо передислокації командування Військово-Морських Сил до м. Одеса і приведення його організаційно-штатної структури у відповідність до завдань та наявних сил і засобів.

                    За активної участі Ради волонтерів при Міністерстві оборони України, інших громадських об’єднань започатковано реформи, які кардинально змінили ситуацію щодо забезпечення військовослужбовців всім необхідним. На постачання Збройних Сил за результатами випробувань у бойових умовах були прийняті сучасні індивідуальні засоби захисту та засоби екіпірування.

                    Значні зусилля Міністерства оборони у 2014 році були зосереджені на підвищення соціального статусу військовослужбовця в суспільстві за рахунок відновлення раніше призупинених соціальних гарантій та пільг, надання спеціальних прав громадянам, які призвані під час мобілізації та беруть участь в антитерористичній операції. Внормовано набуття статусу учасників бойових дій та передбачено пільги для військовослужбовців, які беруть участь в антитерористичній операції.

                    У 2014 році близько 1000 військовослужбовців Збройних Сил України у складі чотирьох національних контингентів та миротворчого персоналу взяли участь в одинадцяти міжнародних операціях з підтримання миру і безпеки на території дев’яти країн світу.

                    Протягом року за підсумками мобілізаційного розгортання військ (сил) сформовано 4 бригади та 29 батальйонів територіальної оборони, які згодом були переформовані в окремі мотопіхотні батальйони.

                    На кінець 2014 року після проведених організаційних заходів чисельність Збройних Сил становила 250,0 тис. осіб, у тому числі 204,0 тис. військовослужбовців.

                    Героїзм і особиста мужність, високий професіоналізм особового складу, виявлені у захисті державного суверенітету і територіальної цілісності України відзначені державою. Усього у 2014 році нагороджено 6548 військовослужбовців, із них: 456 загиблих та 694 поранених, зокрема: звання Герой України присвоєно 8 військовослужбовцям, з них 5 — посмертно.

                    Загалом, 2014 рік став для Збройних Сил України перевіркою на мужність, витривалість, вірність Військовій присязі та відданість державі, увійшов в історію як рік відродження української армії.

                    За результатами комплексного огляду сектору безпеки і оборони у 2015 році затверджено Стратегію національної безпеки України, нову редакцію Воєнної доктрини України та Концепцію розвитку сектору безпеки і оборони України. Вперше у своїй історії Україна визначила курс на європейську інтеграцію та наміри щодо вступу до НАТО, а головною загрозою та ймовірним воєнним противником оголошено Російську Федерацію.

                    Розроблено нову редакцію Стратегічного оборонного бюлетеня України, проведено його громадське обговорення. Підготовлено Державну цільову оборонну програму розвитку озброєння та військової техніки на період до 2020 року.

                    Затверджено військово-адміністративний поділ держави. Удосконалено систему управління Збройними Силами, сформовано Об’єднаний оперативний штаб. Доведено до логічного завершення створення окремого роду військ — Сил спеціальних операцій, сформовано Командування Сил спеціальних операцій. Удосконалено підготовку військ: до навчання українських військових були залучені інструктори з армій країн НАТО та Європейського Союзу. Загалом проведено понад 500 навчань.

                    У 2015 році для недопущення створення передумов гуманітарної катастрофи у районах проведення антитерористичної операції, виникнення соціального напруження на іншій території України, формування позитивної громадської думки щодо діяльності Збройних Сил під час особливого періоду, ліквідації наслідків надзвичайних ситуацій у Збройних Силах впроваджено систему цивільно-військового співробітництва.

                    Незважаючи на постійну складну обстановку в зоні проведення антитерористичної операції та ризики відновлення збройного протистояння, головним завданням Міністерства оборони було реформування Збройних Сил для створення боєздатних, добре оснащених, підготовлених до виконання завдань за призначенням військ (сил).

                    Протягом 2015 року Збройні Сили України відновили боєздатність, набули бойового досвіду, оперативної спроможності, необхідного рівня технічної оснащеності та матеріальної забезпеченості для захисту суверенітету і територіальної цілісності держави, завдяки чому стабілізували обстановку в районі проведення антитерористичної операції.

                    Удосконалено систему управління та всебічного забезпечення Збройних Сил: започатковано пілотні проекти з управління державними підприємствами, з речового, продовольчого та медичного забезпечення військовослужбовців, автоматизації управлінських процесів і процесів обліку та руху матеріальних засобів.

                    Забезпечено реалізацію соціальних гарантій військовослужбовців та членів їх сімей, у тому числі військовослужбовців, призваних за мобілізацією. Встановлено додаткові стимулюючі винагороди.

                    Головні зусилля Міністерства оборони та Генерального штабу у сфері миротворчої діяльності були спрямовані на збереження існуючого формату представництва у міжнародних місіях та продовження виконання взятих Україною міжнародних зобов’язань із залученням мінімально-необхідної кількості матеріальних та фінансових ресурсів.

                    Упродовж 2015 року за мужність і героїзм, виявлені під час захисту державного суверенітету і територіальної цілісності України, державними нагородами України нагороджено 6739 осіб (посмертно 1213 осіб, поранених 4533 особи), з них звання Герой України присвоєно 14 військовослужбовцям, з них 5 — посмертно.

                    Загалом із початку проведення антитерористичної операції у Збройних Силах сформовано 15 бойових бригад, полк, 5 батальйонів (дивізіонів), а також бригаду, 6 полків та 11 батальйонів оперативного (бойового), тилового і технічного забезпечення. Збільшено авіаційний парк та бойовий склад зенітних ракетних військ, сформовано підрозділи для охорони аеродромів і стартових позицій зенітних ракетних військ. Відновлено діяльність 138 районних та міських військових комісаріатів, завдяки чому проведено шість черг часткової мобілізації та призвано понад 200 тис. військовозобов’язаних.

                    Відповідно до ініціативи Президента України — Верховного Головнокомандувача Збройних Сил України, підтриманої Урядом, з 1 січня 2016 року відбулося суттєве збільшення грошового забезпечення військовослужбовців.
                </div>
            </div>
            <Footer/>
        </div>
    );
};

export default History;